{
  "0": "d7d6",
  "1": "g7g6",
  "2": "g8f6",
  "3": "g6g5",
  "4": "a7a6",
  "5": "a6a5",
  "6": "h7h6",
  "7": "f6d7",
  "8": "d7f6",
  "9": "a8a6",
  "10": "c7c6",
  "11": "b8d7",
  "12": "c6c5",
  "13": "d7e5",
  "14": "e5f3",
  "15": "f3h2",
  "16": "h2f1",
  "17": "e7e6",
  "18": "f8e7",
  "19": "h8g8",
  "20": "b7b6",
  "21": "e7f8",
  "22": "d6d5",
  "23": "d5c4",
  "24": "a6a7",
  "25": "a7c7",
  "26": "f6h7",
  "27": "c6d6",
  "28": "g8g6",
  "29": "d8b6",
  "30": "g6f6",
  "31": "f8d6",
  "32": "f6f1",
  "33": "d2d4",
  "34": "e2e3",
  "35": "a2a4",
  "36": "h2h3",
  "37": "g1e2",
  "38": "a1a3",
  "39": "h3h4",
  "40": "h4h5",
  "41": "a3b3",
  "42": "e2g3",
  "43": "d4c5",
  "44": "b3c3",
  "45": "f1a6",
  "46": "a6f1",
  "47": "c3a3",
  "48": "b2b3",
  "49": "b1d2",
  "50": "h1h3",
  "51": "d2f3",
  "52": "e1d2",
  "53": "d2e1",
  "54": "e3f4",
  "55": "g3e2",
  "56": "f3e5",
  "57": "a3a5",
  "58": "h4f4",
  "59": "f4f8",
  "60": "f8f5",
  "61": "a5e5",
  "62": "e5e4",
  "63": "e4d4",
  "64": "d4f4",
  "65": "f4a4",
  "66": "d1d4",
  "67": "d4h8",
  "68": "h8h6",
  "69": "h6g6",
  "70": "a4a2",
  "71": "g6g4",
  "72": "a2a5",
  "73": "g4g5",
  "74": "h5h6",
  "75": "h6h7",
  "76": "h7h8q",
  "77": "a5a7",
  "78": "a7a5",
  "79": "g5g7",
  "80": "a5a8",
  "81": "e2e4",
  "82": "d7d5",
  "83": "g8h6",
  "84": "a8a7",
  "85": "a7a8",
  "86": "d8h4",
  "87": "h4d8",
  "88": "c6d5",
  "89": "a6b6",
  "90": "d8d7",
  "91": "b8c6",
  "92": "d7c7",
  "93": "e8d7",
  "94": "c6e5",
  "95": "e5d3",
  "96": "b6b5",
  "97": "d7e8",
  "98": "h2h4",
  "99": "d1g4",
  "100": "f2f3",
  "101": "b1c3",
  "102": "c3e2",
  "103": "e3e4",
  "104": "e2c3",
  "105": "h1h4",
  "106": "h4g4",
  "107": "g2g3",
  "108": "g7g4",
  "109": "c3a4",
  "110": "g4f4",
  "111": "g3f4",
  "112": "c1b2",
  "113": "a1c1",
  "114": "e1f2",
  "115": "f2e1",
  "116": "b2c1",
  "117": "b2f6",
  "118": "g1f3",
  "119": "f1d3",
  "120": "e1f1",
  "121": "a2a3",
  "122": "d3e2",
  "123": "e2f3",
  "124": "e3d4",
  "125": "d1e1",
  "126": "f1g1",
  "127": "g1g2",
  "128": "h1e1",
  "129": "d2e2",
  "130": "e2a6",
  "131": "f3d5",
  "132": "d5c6",
  "133": "e7e5",
  "134": "b8a6",
  "135": "b7a6",
  "136": "d8f6",
  "137": "f6g6",
  "138": "g6e6",
  "139": "e6c6",
  "140": "d7c6",
  "141": "c8g4",
  "142": "g4f5",
  "143": "f7e6",
  "144": "f5c2",
  "145": "c2g6",
  "146": "g6e4",
  "147": "a8d8",
  "148": "h7h5",
  "149": "h7f6",
  "150": "f6d5",
  "151": "d8e8",
  "152": "h6f6",
  "153": "f6e6",
  "154": "e6e3",
  "155": "d5e3",
  "156": "f8a3",
  "157": "a3e7",
  "158": "e8d8",
  "159": "e7c5",
  "160": "c5d6",
  "161": "d1f3",
  "162": "f3d3",
  "163": "d3c4",
  "164": "b1a3",
  "165": "c4b3",
  "166": "b3d5",
  "167": "a3c2",
  "168": "h3b3",
  "169": "b3b6",
  "170": "d1e2",
  "171": "f1c4",
  "172": "c4e6",
  "173": "f3g3",
  "174": "f3g5",
  "175": "g5e4",
  "176": "g3h3",
  "177": "h3e6",
  "178": "e6e5",
  "179": "e4c5",
  "180": "f6e5",
  "181": "e5c5",
  "182": "b7b5",
  "183": "c5c2",
  "184": "a8b8",
  "185": "b8b6",
  "186": "c8a6",
  "187": "c7b6",
  "188": "b5b4",
  "189": "f7f5",
  "190": "c6b7",
  "191": "e6d5",
  "192": "a6c7",
  "193": "h6g5",
  "194": "d5f4",
  "195": "f7f6",
  "196": "c7a6",
  "197": "d8c7",
  "198": "c6c7",
  "199": "c7b7",
  "200": "f4g2",
  "201": "h8h4",
  "202": "h4h3",
  "203": "h3f3",
  "204": "b6a5",
  "205": "a5b4",
  "206": "g2h4",
  "207": "b4c5",
  "208": "c5d4",
  "209": "d4e5",
  "210": "e5d6",
  "211": "g1h3",
  "212": "g2g4",
  "213": "g4h5",
  "214": "c3b5",
  "215": "h1g1",
  "216": "g1g7",
  "217": "g7g8",
  "218": "b5c7",
  "219": "c7a8",
  "220": "d3f1",
  "221": "c8b7",
  "222": "b7e4",
  "223": "c7d6",
  "224": "c7c2",
  "225": "b8c8",
  "226": "e8e7",
  "227": "e7d6",
  "228": "f6g8",
  "229": "d5e4",
  "230": "e4f5",
  "231": "f5e4",
  "232": "d6e7",
  "233": "f6g4",
  "234": "f3d4",
  "235": "f1e2",
  "236": "g3e4",
  "237": "c1e3",
  "238": "e1d1",
  "239": "d4d5",
  "240": "c2c3",
  "241": "d1d2",
  "242": "d2c2",
  "243": "c2d2",
  "244": "d2d3",
  "245": "d3e3",
  "246": "f4e5",
  "247": "e5f6",
  "248": "c3c4",
  "249": "d5d6",
  "250": "a4a5",
  "251": "g2f3",
  "252": "a1a4",
  "253": "a4c4",
  "254": "b2b4",
  "255": "a4c5",
  "256": "c4c5",
  "257": "c2d3",
  "258": "e2d1",
  "259": "e1e2",
  "260": "c1d2",
  "261": "f3f4",
  "262": "d2f4",
  "263": "f4e3",
  "264": "d3d4",
  "265": "e4d5",
  "266": "e5f5",
  "267": "c6b8",
  "268": "c6b6",
  "269": "e8f8",
  "270": "f8g7",
  "271": "c8e6",
  "272": "e6d7",
  "273": "d7e6",
  "274": "d8d3",
  "275": "e6c4",
  "276": "a6b4",
  "277": "d3d1",
  "278": "b4d3",
  "279": "d5c5",
  "280": "c5b5",
  "281": "b5a5",
  "282": "a5a6",
  "283": "a6b7",
  "284": "d3e5",
  "285": "e5g4",
  "286": "a5b5",
  "287": "g4f2",
  "288": "c4e2",
  "289": "b5c4",
  "290": "d3e4",
  "291": "h3g5",
  "292": "c2b3",
  "293": "f3e4",
  "294": "c3a2",
  "295": "d1c2",
  "296": "c3b1",
  "297": "c3b4",
  "298": "e2e8",
  "299": "b2c3",
  "300": "c3d4",
  "301": "c3c2",
  "302": "f3h4",
  "303": "h4f3",
  "304": "a3b5",
  "305": "b5c3",
  "306": "e1g1",
  "307": "f1f2",
  "308": "c1f4",
  "309": "d1d5",
  "310": "a1d1",
  "311": "c5a7",
  "312": "a4b5",
  "313": "f2f4",
  "314": "h2g3",
  "315": "g1h2",
  "316": "d1f1",
  "317": "f1f4",
  "318": "f4h4",
  "319": "h4h8",
  "320": "h8h5",
  "321": "c3e4",
  "322": "c6d4",
  "323": "e5d4",
  "324": "c8d7",
  "325": "h6g4",
  "326": "g7g5",
  "327": "g5f4",
  "328": "d8c8",
  "329": "g8g4",
  "330": "g4g6",
  "331": "g4f6",
  "332": "c8h3",
  "333": "h3c8",
  "334": "f6h5",
  "335": "d8d6",
  "336": "d6e5",
  "337": "d4c2",
  "338": "c2a1",
  "339": "e5b2",
  "340": "b2b6",
  "341": "e7f7",
  "342": "f7g8",
  "343": "h8h7",
  "344": "b7c6",
  "345": "h7e7",
  "346": "c6e7",
  "347": "e7c8",
  "348": "c8a7",
  "349": "a7b5",
  "350": "c7e6",
  "351": "c8c7",
  "352": "c7a5",
  "353": "e6c5",
  "354": "c5d3",
  "355": "d3b2",
  "356": "f7g6",
  "357": "h7h8",
  "358": "a3c3",
  "359": "h6h5",
  "360": "h5h3",
  "361": "d4e2",
  "362": "b6h6",
  "363": "h6h3",
  "364": "h3h2",
  "365": "h2h1",
  "366": "h1c1",
  "367": "c1c2",
  "368": "d6c5",
  "369": "c5b4",
  "370": "h4h2",
  "371": "a6d3",
  "372": "b4a3",
  "373": "a3b4",
  "374": "h2d6",
  "375": "d6a6",
  "376": "a6a8",
  "377": "g5g4",
  "378": "g4f3",
  "379": "a8e4",
  "380": "f3f2",
  "381": "f2f1q",
  "382": "f4f3",
  "383": "d5d4",
  "384": "d4d1",
  "385": "f6e4",
  "386": "f2d4",
  "387": "f5f4",
  "388": "g5h3",
  "389": "d2e3",
  "390": "a1b1",
  "391": "b3b4",
  "392": "f1b5",
  "393": "b5c6",
  "394": "b1b4",
  "395": "b4c4",
  "396": "c4b4",
  "397": "g5f7",
  "398": "f7d6",
  "399": "b4b3",
  "400": "c3c6",
  "401": "c6c2",
  "402": "c2e2",
  "403": "d1a1",
  "404": "g5h6",
  "405": "g1g4",
  "406": "g4h4",
  "407": "h4h6",
  "408": "e2a2",
  "409": "e3c1",
  "410": "b4d2",
  "411": "d2h6",
  "412": "b5a7",
  "413": "a3a4",
  "414": "b1a1",
  "415": "c5e4",
  "416": "f4g5",
  "417": "h5g6",
  "418": "h1h7",
  "419": "h8a8",
  "420": "b3a3",
  "421": "b5b6",
  "422": "f1h3",
  "423": "c3d5",
  "424": "b3b5",
  "425": "d5e7",
  "426": "h3g2",
  "427": "d2c3",
  "428": "c3a1",
  "429": "a5c5",
  "430": "f8e8",
  "431": "a6b5",
  "432": "a8a3",
  "433": "d5b4",
  "434": "g1g8",
  "435": "g8d8",
  "436": "d1c1",
  "437": "e3g3",
  "438": "g3h4",
  "439": "b1b3",
  "440": "h5f7",
  "441": "f7h5",
  "442": "h5f3",
  "443": "f3h3",
  "444": "f4f5",
  "445": "f5f6",
  "446": "f6f7",
  "447": "f7f8q",
  "448": "f5e5",
  "449": "h3h6",
  "450": "e5d5",
  "451": "g7h6",
  "452": "c6b4",
  "453": "b4c6",
  "454": "d8g5",
  "455": "e8f7",
  "456": "g2h3",
  "457": "e4c3",
  "458": "f3d2",
  "459": "d2e4",
  "460": "e4f6",
  "461": "h4g5",
  "462": "g5f3",
  "463": "h3h5",
  "464": "a2c3",
  "465": "b5d4",
  "466": "d4e6",
  "467": "e6d8",
  "468": "e5c6",
  "469": "h5h8",
  "470": "h8f8",
  "471": "b6b8",
  "472": "d4a7",
  "473": "a5a3",
  "474": "g5g6",
  "475": "g6g7",
  "476": "g7g8q",
  "477": "a3a6",
  "478": "g8g7",
  "479": "c2c4",
  "480": "c5c6",
  "481": "g7f7",
  "482": "f7d5",
  "483": "c1g5",
  "484": "b4b5",
  "485": "d5e5",
  "486": "d5f3",
  "487": "b6b7",
  "488": "b7b8q",
  "489": "c5c8",
  "490": "a3c4",
  "491": "f1e1",
  "492": "b5d6",
  "493": "d6f5",
  "494": "f5g7",
  "495": "e3d5",
  "496": "d8a8",
  "497": "d7f5",
  "498": "a8c8",
  "499": "b4a6",
  "500": "d7c8",
  "501": "g4e3",
  "502": "c8d8",
  "503": "a8a5",
  "504": "b5b2",
  "505": "b2a2",
  "506": "e4f2",
  "507": "f8c5",
  "508": "e3d2",
  "509": "e5f4",
  "510": "h5g4",
  "511": "g4h3",
  "512": "h4h1",
  "513": "e4g5",
  "514": "c7c5",
  "515": "e6c7",
  "516": "a5a4",
  "517": "d6b4",
  "518": "b4d6",
  "519": "f7e5",
  "520": "b6e6",
  "521": "e6e4",
  "522": "a6c5",
  "523": "e4g4",
  "524": "c5a4",
  "525": "a4b2",
  "526": "b2a4",
  "527": "e7d8",
  "528": "c5d5",
  "529": "d5e6",
  "530": "e6f6",
  "531": "f6g5",
  "532": "a3g3",
  "533": "d4d3",
  "534": "h3f5",
  "535": "f5d7",
  "536": "g5h7",
  "537": "f1g2",
  "538": "g1h1",
  "539": "f8h6",
  "540": "h5f4",
  "541": "g2e3",
  "542": "d4b5",
  "543": "h5h4",
  "544": "d7b5",
  "545": "h5g5",
  "546": "g5g1",
  "547": "h4f2",
  "548": "g1e1",
  "549": "h2h1q",
  "550": "h1h2",
  "551": "d4c6",
  "552": "h6e6",
  "553": "a8h8",
  "554": "e8g8",
  "555": "g8h8",
  "556": "g6h5",
  "557": "g4e5",
  "558": "e5c4",
  "559": "c4a3",
  "560": "e7b4",
  "561": "g6h6",
  "562": "c6a5",
  "563": "a5b3",
  "564": "f8f4",
  "565": "e6f5",
  "566": "g6f7",
  "567": "e7h4",
  "568": "g5d2",
  "569": "b4d5",
  "570": "b4c2",
  "571": "c2d4",
  "572": "g8h7",
  "573": "e6d4",
  "574": "d4f3",
  "575": "g5e6",
  "576": "d4f5",
  "577": "f5e3",
  "578": "e3g4",
  "579": "g4h2",
  "580": "h2g4",
  "581": "d8f8",
  "582": "a8e8",
  "583": "e8e4",
  "584": "e4e3",
  "585": "e3e2",
  "586": "h6c1",
  "587": "f8f1",
  "588": "b8b2",
  "589": "b2c2",
  "590": "c2a2",
  "591": "b5a4",
  "592": "a4b3",
  "593": "a1a6",
  "594": "d1h5",
  "595": "b3a4",
  "596": "d2c4",
  "597": "c4e3",
  "598": "a4c6",
  "599": "f1d1",
  "600": "e3f5",
  "601": "f5d4",
  "602": "c6a7",
  "603": "d2a5",
  "604": "c5b6",
  "605": "b6c7",
  "606": "d6c4",
  "607": "c7d8",
  "608": "d8a5",
  "609": "a5d8",
  "610": "c4d6",
  "611": "d6b7",
  "612": "b7d8",
  "613": "d8b7",
  "614": "e5c7",
  "615": "b6d8",
  "616": "b1c1",
  "617": "b6a7",
  "618": "c1a1",
  "619": "h4g6",
  "620": "d1h1",
  "621": "b5a6",
  "622": "g5e7",
  "623": "c4b5",
  "624": "b5d3",
  "625": "b3b8",
  "626": "e1e3",
  "627": "e3f3",
  "628": "f3f6",
  "629": "c3a5",
  "630": "e5g6",
  "631": "c7c3",
  "632": "g6f4",
  "633": "b8b4",
  "634": "f4d3",
  "635": "g8f7",
  "636": "e4e1",
  "637": "d3e1",
  "638": "b4e4",
  "639": "a1e1",
  "640": "f2g2",
  "641": "g2h2",
  "642": "h2a2",
  "643": "a2a8",
  "644": "g4g3",
  "645": "g3g2",
  "646": "g2g1q",
  "647": "c3d1",
  "648": "c4d3",
  "649": "d3f5",
  "650": "d1b2",
  "651": "c1a3",
  "652": "a1d4",
  "653": "e4d3",
  "654": "e1e8",
  "655": "f5h3",
  "656": "b4c3",
  "657": "c3f6",
  "658": "g2d5",
  "659": "h6f5",
  "660": "f6f5",
  "661": "e4d6",
  "662": "f5g4",
  "663": "d6b5",
  "664": "f8h8",
  "665": "e7g5",
  "666": "e6h3",
  "667": "f8b4",
  "668": "b4e7",
  "669": "g8g2",
  "670": "g2f2",
  "671": "e1h4",
  "672": "h3f4",
  "673": "c1c3",
  "674": "f4d5",
  "675": "d5b6",
  "676": "b6c8",
  "677": "c8d6",
  "678": "e3c5",
  "679": "b6d4",
  "680": "d4d6",
  "681": "d3g6",
  "682": "c3b3",
  "683": "d6d8",
  "684": "d5f6",
  "685": "c5b7",
  "686": "c6e4",
  "687": "d8e7",
  "688": "f6e8",
  "689": "c7e8",
  "690": "e8f6",
  "691": "a6d6",
  "692": "c2c1",
  "693": "c2c6",
  "694": "f2h3",
  "695": "h3f2",
  "696": "c6c4",
  "697": "g7f6",
  "698": "e8e6",
  "699": "d6h2",
  "700": "d8d4",
  "701": "b6a6",
  "702": "c5e6",
  "703": "e6f4",
  "704": "e2f2",
  "705": "f2e2",
  "706": "h2g2",
  "707": "e2e6",
  "708": "e1e7",
  "709": "f5h5",
  "710": "f2e3",
  "711": "f5g6",
  "712": "f4e4",
  "713": "e4e8",
  "714": "d4e4",
  "715": "e4f4",
  "716": "d4c3",
  "717": "c3b2",
  "718": "c2b1",
  "719": "c1d1",
  "720": "e2d3",
  "721": "d3c3",
  "722": "c3d2",
  "723": "b1b2",
  "724": "c4e5",
  "725": "d3c5",
  "726": "b7c5",
  "727": "d1b3",
  "728": "h3d7",
  "729": "e1h1",
  "730": "a6f6",
  "731": "f6a6",
  "732": "h3g3",
  "733": "e2e1",
  "734": "e2d2",
  "735": "c2e3",
  "736": "a1g1",
  "737": "e3c4",
  "738": "c4a5",
  "739": "d6e4",
  "740": "h1a1",
  "741": "c6d8",
  "742": "b2a3",
  "743": "a1f1",
  "744": "a3c5",
  "745": "e5h2",
  "746": "b5e2",
  "747": "b3c5",
  "748": "f3h5",
  "749": "f3c6",
  "750": "e6g6",
  "751": "g6f5",
  "752": "e2g4",
  "753": "e2f4",
  "754": "g2g5",
  "755": "f4g6",
  "756": "a1a5",
  "757": "f4h3",
  "758": "f3g4",
  "759": "a6c6",
  "760": "h5h7",
  "761": "h7f5",
  "762": "f4e6",
  "763": "a5c4",
  "764": "h8g7",
  "765": "b2d3",
  "766": "h5f6",
  "767": "b4a5",
  "768": "b6c4",
  "769": "c4b2",
  "770": "a5b6",
  "771": "b2c4",
  "772": "b8a8",
  "773": "g4a4",
  "774": "a2a1",
  "775": "a1a2",
  "776": "c8f5",
  "777": "a4e4",
  "778": "e4e5",
  "779": "f8g8",
  "780": "c2e4",
  "781": "h7g6",
  "782": "d1d3",
  "783": "d3b5",
  "784": "h3g4",
  "785": "f1f3",
  "786": "c1e1",
  "787": "e6g7",
  "788": "g7e6",
  "789": "c4d5",
  "790": "d3d7",
  "791": "e6f8",
  "792": "f8e6",
  "793": "d4b3",
  "794": "e2f1",
  "795": "b5d5",
  "796": "b5f1",
  "797": "f3g1",
  "798": "g4h6",
  "799": "f5e7",
  "800": "c5d7",
  "801": "b8b3",
  "802": "f8f7",
  "803": "e6d6",
  "804": "g5e3",
  "805": "g5f5",
  "806": "a8f8",
  "807": "g2h1",
  "808": "h1e4",
  "809": "b3c4",
  "810": "b1b5",
  "811": "b5c5",
  "812": "b7a5",
  "813": "a5c6",
  "814": "f5h6",
  "815": "f4b8",
  "816": "e5d7",
  "817": "d7b6",
  "818": "g8e7",
  "819": "e7c6",
  "820": "e2b5",
  "821": "a1b3",
  "822": "b3a5",
  "823": "g7h5",
  "824": "h5g7",
  "825": "g7f5",
  "826": "h4e7",
  "827": "d5a8",
  "828": "h1d1",
  "829": "d1d6",
  "830": "h6g8",
  "831": "g4e6",
  "832": "e6b3",
  "833": "e8c6",
  "834": "c6d7",
  "835": "f7f4",
  "836": "d7f7",
  "837": "f7c4",
  "838": "f2d1",
  "839": "c4g8",
  "840": "e8b8",
  "841": "g7d7",
  "842": "c8h8",
  "843": "d7d2",
  "844": "d2b2",
  "845": "b2b5",
  "846": "b5f5",
  "847": "g5d5",
  "848": "d5a5",
  "849": "f5d3",
  "850": "f8d8",
  "851": "d8d5",
  "852": "g6h4",
  "853": "h4f5",
  "854": "f5h4",
  "855": "e1e4",
  "856": "b5b7",
  "857": "f3e1",
  "858": "b7b3",
  "859": "e1d3",
  "860": "a1e5",
  "861": "g1f2",
  "862": "f2g1",
  "863": "e5g5",
  "864": "e2h5",
  "865": "e1g3",
  "866": "f2g3",
  "867": "b5b3",
  "868": "b3b2",
  "869": "e1f3",
  "870": "g1f1",
  "871": "d2d1",
  "872": "g5c1",
  "873": "b1b6",
  "874": "b6b2",
  "875": "f3d1",
  "876": "e5f7",
  "877": "e1e5",
  "878": "c5b3",
  "879": "b3d4",
  "880": "c7b5",
  "881": "b2d4",
  "882": "g6g2",
  "883": "d7g4",
  "884": "a6e2",
  "885": "g4g2",
  "886": "e5g3",
  "887": "g3e1",
  "888": "g2f1",
  "889": "e8c8",
  "890": "d8h8",
  "891": "b6c5",
  "892": "d3d2",
  "893": "d2d1q",
  "894": "e4a8",
  "895": "e8e1",
  "896": "g5h4",
  "897": "d3c2",
  "898": "e1c1",
  "899": "e3d3",
  "900": "e7f5",
  "901": "a3b2",
  "902": "d1g1",
  "903": "b2e5",
  "904": "d6g3",
  "905": "d7c5",
  "906": "d7e7",
  "907": "e7d5",
  "908": "e4g3",
  "909": "a2b3",
  "910": "a4b4",
  "911": "e1b4",
  "912": "g3f5",
  "913": "f5d6",
  "914": "d6e8",
  "915": "d2g2",
  "916": "c5e3",
  "917": "d7f8",
  "918": "f8g6",
  "919": "g6e5",
  "920": "f2f5",
  "921": "e3h6",
  "922": "f5f8",
  "923": "b7h1",
  "924": "c8b8",
  "925": "b8a7",
  "926": "c7c4",
  "927": "c4c1",
  "928": "d3f4",
  "929": "f4h5",
  "930": "h5g3",
  "931": "e3a7",
  "932": "h3e3",
  "933": "d3a6",
  "934": "e3e8",
  "935": "e2c4",
  "936": "d2c1",
  "937": "d7a4",
  "938": "a1c2",
  "939": "c2b4",
  "940": "a3b1",
  "941": "a5c3",
  "942": "d2b3",
  "943": "f1c1",
  "944": "c1b1",
  "945": "e7f6",
  "946": "f8f6",
  "947": "f6h6",
  "948": "f2g4",
  "949": "h6h2",
  "950": "h2c2",
  "951": "c2b2",
  "952": "e6g4",
  "953": "h6e3",
  "954": "e7g6",
  "955": "f6e7",
  "956": "g6h8",
  "957": "a8a4",
  "958": "d7d8",
  "959": "a4d4",
  "960": "f3e3",
  "961": "b8b5",
  "962": "d5c7",
  "963": "d6f4",
  "964": "f4d6",
  "965": "g4g1",
  "966": "c6b5",
  "967": "g1a1",
  "968": "e2e1q",
  "969": "e1a1",
  "970": "a4a1",
  "971": "g3g4",
  "972": "b1b7",
  "973": "b7g7",
  "974": "a3a7",
  "975": "g6g8",
  "976": "d8e6",
  "977": "a7d4",
  "978": "d4e3",
  "979": "e3h3",
  "980": "f5f3",
  "981": "c3e1",
  "982": "d3f2",
  "983": "d1f2",
  "984": "h3g1",
  "985": "e3d1",
  "986": "d1e3",
  "987": "e3f1",
  "988": "f1g3",
  "989": "b8b1",
  "990": "f5b1",
  "991": "b1c2",
  "992": "g3e3",
  "993": "e1g2",
  "994": "d4c4",
  "995": "b4g4",
  "996": "h4g2",
  "997": "g2f4",
  "998": "c2a3",
  "999": "c1h6",
  "1000": "a5d2",
  "1001": "c1c7",
  "1002": "a3f8",
  "1003": "f4e2",
  "1004": "f7e8",
  "1005": "d5c3",
  "1006": "e7c7",
  "1007": "f7f8",
  "1008": "d8g8",
  "1009": "b8f8",
  "1010": "b7c8",
  "1011": "g8g5",
  "1012": "e6a6",
  "1013": "a6e6",
  "1014": "b6b4",
  "1015": "g7f8",
  "1016": "b4h4",
  "1017": "f4c1",
  "1018": "a2a7",
  "1019": "a7g7",
  "1020": "f7g7",
  "1021": "g7b7",
  "1022": "b7e7",
  "1023": "c5c4",
  "1024": "c4c3",
  "1025": "f3e2",
  "1026": "e8e5",
  "1027": "g2d2",
  "1028": "c2c8",
  "1029": "g8f8",
  "1030": "d7h3",
  "1031": "c8c2",
  "1032": "e5c3",
  "1033": "c3d3",
  "1034": "b2e2",
  "1035": "b5e8",
  "1036": "f3h1",
  "1037": "c8a8",
  "1038": "d6c8",
  "1039": "e7e2",
  "1040": "h6d2",
  "1041": "h8h2",
  "1042": "f2e4",
  "1043": "e4d2",
  "1044": "h4g3",
  "1045": "g3h2",
  "1046": "e4e6",
  "1047": "f5e6",
  "1048": "e6e7",
  "1049": "b1e1",
  "1050": "h7g8",
  "1051": "f6b2",
  "1052": "e8e2",
  "1053": "a3d6",
  "1054": "f2f1",
  "1055": "c8c6",
  "1056": "f8a8",
  "1057": "h8c8",
  "1058": "e1e6",
  "1059": "e7g7",
  "1060": "d1a4",
  "1061": "a4a7",
  "1062": "a7b7",
  "1063": "a3d3",
  "1064": "d3d8",
  "1065": "d4b6",
  "1066": "c1c5",
  "1067": "b5a3",
  "1068": "d8b8",
  "1069": "e7e8",
  "1070": "e3g5",
  "1071": "e4c6",
  "1072": "c6c8",
  "1073": "d1d7",
  "1074": "e8h8",
  "1075": "c4d2",
  "1076": "b6f2",
  "1077": "a4a3",
  "1078": "c4f7",
  "1079": "d5d3",
  "1080": "c1c6",
  "1081": "c7g7",
  "1082": "e3e6",
  "1083": "d3c1",
  "1084": "c1d3",
  "1085": "f2h1",
  "1086": "h1f2",
  "1087": "e2d4",
  "1088": "a8a2",
  "1089": "a2c2",
  "1090": "b8e8",
  "1091": "e8e3",
  "1092": "f2d3",
  "1093": "e3c3",
  "1094": "d2a2",
  "1095": "h6g7",
  "1096": "e4f3",
  "1097": "f3g2",
  "1098": "f4g4",
  "1099": "g5f6",
  "1100": "h1f1",
  "1101": "f1f6",
  "1102": "g5h5",
  "1103": "d5b5",
  "1104": "d6f8",
  "1105": "b2b1",
  "1106": "a4c2",
  "1107": "d7a7",
  "1108": "a7d7",
  "1109": "d7d3",
  "1110": "c2f5",
  "1111": "c5c7",
  "1112": "c7c8",
  "1113": "c8g8",
  "1114": "c2c1q",
  "1115": "d2c1q",
  "1116": "a6c4",
  "1117": "d5f5",
  "1118": "d6a3",
  "1119": "d5b7",
  "1120": "h3f1",
  "1121": "b7g2",
  "1122": "c6a8",
  "1123": "e3e7",
  "1124": "g3f3",
  "1125": "f5f1",
  "1126": "c5e7",
  "1127": "e7a3",
  "1128": "e3f2",
  "1129": "g3f2",
  "1130": "c3c5",
  "1131": "h1d5",
  "1132": "d5b3",
  "1133": "a7c6",
  "1134": "b3b1",
  "1135": "b1g1",
  "1136": "c6g2",
  "1137": "d3b4",
  "1138": "e4b4",
  "1139": "b4b7",
  "1140": "b7c7",
  "1141": "e7d7",
  "1142": "h8d8",
  "1143": "h2g1",
  "1144": "b1d1",
  "1145": "d1d8",
  "1146": "b4f8",
  "1147": "d3d6",
  "1148": "b8h8",
  "1149": "c4b6",
  "1150": "b6a4",
  "1151": "c2b1q",
  "1152": "d6b8",
  "1153": "f5d5",
  "1154": "c2e1",
  "1155": "d5d1",
  "1156": "e5e3",
  "1157": "f1f7",
  "1158": "d1b1",
  "1159": "b1b8",
  "1160": "b8c7",
  "1161": "f1b1",
  "1162": "d4f2",
  "1163": "f2a7",
  "1164": "a7g1",
  "1165": "h1g2",
  "1166": "g1a7",
  "1167": "h2d2",
  "1168": "c8c4",
  "1169": "c4e4",
  "1170": "e4e7",
  "1171": "g2c6",
  "1172": "b1a2",
  "1173": "e4c4",
  "1174": "b4a4",
  "1175": "b3c2",
  "1176": "e5e6",
  "1177": "d4g7",
  "1178": "d6f6",
  "1179": "f6f3",
  "1180": "h8e8",
  "1181": "e4c2",
  "1182": "c2a4",
  "1183": "f6c3",
  "1184": "c5a6",
  "1185": "c2d1",
  "1186": "a4e8",
  "1187": "c8c1",
  "1188": "a7f2",
  "1189": "b8d8",
  "1190": "e4g2",
  "1191": "c6a4",
  "1192": "a4d7",
  "1193": "c4a2",
  "1194": "a2d5",
  "1195": "a8d5",
  "1196": "c3e3",
  "1197": "g6c6",
  "1198": "c6e8",
  "1199": "e2c2",
  "1200": "a1a7",
  "1201": "a6a1",
  "1202": "d3b3",
  "1203": "g2g1",
  "1204": "g4e2",
  "1205": "e7e4",
  "1206": "f8f3",
  "1207": "d4d2",
  "1208": "b1d3",
  "1209": "d3d5",
  "1210": "d5h5",
  "1211": "e4e2",
  "1212": "h5h2",
  "1213": "h2f2",
  "1214": "b8b7",
  "1215": "e6g5",
  "1216": "f6f2",
  "1217": "c4c2",
  "1218": "d2b4",
  "1219": "f1a1",
  "1220": "a5b7",
  "1221": "d4a4",
  "1222": "c4f4",
  "1223": "d5d8",
  "1224": "g5d8",
  "1225": "d8d1",
  "1226": "a4g4",
  "1227": "h5e2",
  "1228": "f4d2",
  "1229": "h6f7",
  "1230": "f5g3",
  "1231": "e3b6",
  "1232": "f6h4",
  "1233": "g1d1",
  "1234": "c8e8",
  "1235": "h5f5",
  "1236": "f4h6",
  "1237": "e5e7",
  "1238": "b3d1",
  "1239": "b6e3",
  "1240": "e6a2",
  "1241": "a2b1",
  "1242": "a7b6",
  "1243": "b1e4",
  "1244": "c5a3",
  "1245": "g5g3",
  "1246": "f5f2",
  "1247": "g6h7",
  "1248": "c5f2",
  "1249": "d4d7",
  "1250": "c5f8",
  "1251": "f3f8",
  "1252": "a8b7",
  "1253": "c7c8q",
  "1254": "b4b6",
  "1255": "f4f2",
  "1256": "a2c1",
  "1257": "c1b3",
  "1258": "f6c6",
  "1259": "c6h6",
  "1260": "e2e7",
  "1261": "e6b6",
  "1262": "h6b6",
  "1263": "b3g8",
  "1264": "e4h7",
  "1265": "f6d4",
  "1266": "a4b6",
  "1267": "b6d7",
  "1268": "e3b3",
  "1269": "b7d6",
  "1270": "h7h2",
  "1271": "d6c6",
  "1272": "h3h1",
  "1273": "d6f7",
  "1274": "g6d3",
  "1275": "e5e1",
  "1276": "d2d8",
  "1277": "d6c7",
  "1278": "c7d5",
  "1279": "h7g5",
  "1280": "e2e5",
  "1281": "b5d7",
  "1282": "b6d5",
  "1283": "d8f7",
  "1284": "f7d8",
  "1285": "e3e1",
  "1286": "b5b8",
  "1287": "e6e2",
  "1288": "d2g5",
  "1289": "b2d1",
  "1290": "b6c6",
  "1291": "f4f6",
  "1292": "c4c8",
  "1293": "f5c8",
  "1294": "f5h7",
  "1295": "a7e3",
  "1296": "f7g5",
  "1297": "c4f1",
  "1298": "g7d4",
  "1299": "d5g5",
  "1300": "f8f2",
  "1301": "c8f8",
  "1302": "b4a2",
  "1303": "f8c8",
  "1304": "f1f5",
  "1305": "a1h1",
  "1306": "c8c5",
  "1307": "c5e5",
  "1308": "h2b8",
  "1309": "c5f5",
  "1310": "b8e5",
  "1311": "g4e4",
  "1312": "b2g7",
  "1313": "g7e5",
  "1314": "a7b8",
  "1315": "a5a1",
  "1316": "g8e8",
  "1317": "c7d7",
  "1318": "c6c1",
  "1319": "c7a7",
  "1320": "a7a4",
  "1321": "c2f2",
  "1322": "d3g3",
  "1323": "c5g5",
  "1324": "g3e5",
  "1325": "e8d6",
  "1326": "d6d7",
  "1327": "d7d8q",
  "1328": "c3c8",
  "1329": "e8g6",
  "1330": "b7d5",
  "1331": "d5f7",
  "1332": "e3e5",
  "1333": "f5g5",
  "1334": "a3a2",
  "1335": "a2d2",
  "1336": "d8d2",
  "1337": "g3h5",
  "1338": "d6b6",
  "1339": "g2e2",
  "1340": "a7a8q",
  "1341": "d4d8",
  "1342": "c6f3",
  "1343": "g5g2",
  "1344": "c1c8",
  "1345": "a2b4",
  "1346": "a3f3",
  "1347": "f5c5",
  "1348": "c4d4",
  "1349": "d4f6",
  "1350": "d2h2",
  "1351": "b2d2",
  "1352": "d5d2",
  "1353": "a1a8",
  "1354": "c1c4",
  "1355": "b6b1",
  "1356": "c2c7",
  "1357": "e2h2",
  "1358": "f2h4",
  "1359": "e2b2",
  "1360": "e3c2",
  "1361": "d8c6",
  "1362": "b4b2",
  "1363": "h4f6",
  "1364": "g8g1",
  "1365": "g1g3",
  "1366": "g3g1",
  "1367": "e7e1",
  "1368": "a4a6",
  "1369": "g3b3",
  "1370": "b3b7",
  "1371": "b7b8",
  "1372": "b8g8",
  "1373": "g8g3",
  "1374": "e5e2",
  "1375": "b3c1",
  "1376": "c1e2",
  "1377": "f1f8",
  "1378": "g5b5",
  "1379": "e6f7",
  "1380": "h7g7",
  "1381": "a2a1q",
  "1382": "f4g3",
  "1383": "g3g7",
  "1384": "d2b1",
  "1385": "b6a8",
  "1386": "a8c7",
  "1387": "f3a3",
  "1388": "b7a8",
  "1389": "d7b8",
  "1390": "c3e5",
  "1391": "e5h8",
  "1392": "h8f6",
  "1393": "c7c1",
  "1394": "c8b6",
  "1395": "a8a1",
  "1396": "h7f7",
  "1397": "f7f2",
  "1398": "f2f6",
  "1399": "g7h8",
  "1400": "c5a5",
  "1401": "a6a2",
  "1402": "c6c3",
  "1403": "a3c1",
  "1404": "c4c7",
  "1405": "d3h3",
  "1406": "f3c3",
  "1407": "d2f2",
  "1408": "a2b2",
  "1409": "a8g8",
  "1410": "d6e6",
  "1411": "b7a7",
  "1412": "g8b8",
  "1413": "b8d6",
  "1414": "e6e8",
  "1415": "g7e7",
  "1416": "f6g7",
  "1417": "d7d4",
  "1418": "d4a1",
  "1419": "b3a2",
  "1420": "e8g7",
  "1421": "f6d6",
  "1422": "d6d4",
  "1423": "d4b2",
  "1424": "b3d2",
  "1425": "c6a6",
  "1426": "a6a4",
  "1427": "b4e1",
  "1428": "b4b1",
  "1429": "a1c3",
  "1430": "h6f8",
  "1431": "b2f2",
  "1432": "d5g2",
  "1433": "g2e4",
  "1434": "e4h1",
  "1435": "g1c1",
  "1436": "b2b1q",
  "1437": "e7e8q",
  "1438": "f6f4",
  "1439": "f3f7",
  "1440": "h7d3",
  "1441": "b3f7",
  "1442": "b3e6",
  "1443": "e6g8",
  "1444": "d3f3",
  "1445": "g3h1",
  "1446": "h1g3",
  "1447": "f5f7",
  "1448": "c2c5",
  "1449": "c5c1",
  "1450": "a6c8",
  "1451": "f2c5",
  "1452": "g4c4",
  "1453": "c4a6",
  "1454": "c4g4",
  "1455": "g4b4",
  "1456": "g4d4",
  "1457": "d7b7",
  "1458": "f7e7",
  "1459": "e5e8",
  "1460": "f2d2",
  "1461": "h4h7",
  "1462": "e5h5",
  "1463": "e6c8",
  "1464": "c5c3",
  "1465": "c3f3",
  "1466": "h4b4",
  "1467": "f2h2",
  "1468": "h2b2",
  "1469": "h1f3",
  "1470": "e4h4",
  "1471": "h5e5",
  "1472": "d7e8q",
  "1473": "f2c2",
  "1474": "a7e7",
  "1475": "a2f7",
  "1476": "a7f7",
  "1477": "d6h6",
  "1478": "f2a2",
  "1479": "c7e5",
  "1480": "b5h5",
  "1481": "f3f5",
  "1482": "f7c7",
  "1483": "b7f3",
  "1484": "c6e6",
  "1485": "h2f4",
  "1486": "b4d4",
  "1487": "f2f8",
  "1488": "h6h4",
  "1489": "g3g6",
  "1490": "g4g7",
  "1491": "e7e3",
  "1492": "f7h8",
  "1493": "f7b7",
  "1494": "c2g2",
  "1495": "h3a3",
  "1496": "g4d1",
  "1497": "h4e4",
  "1498": "g3d6",
  "1499": "h5c5",
  "1500": "c4c6",
  "1501": "e8a8",
  "1502": "b6b3",
  "1503": "e2g2",
  "1504": "b1f5",
  "1505": "c7f7",
  "1506": "d7d1",
  "1507": "b2h8",
  "1508": "h8c3",
  "1509": "d2d5",
  "1510": "e6e1",
  "1511": "a1b2",
  "1512": "e3a3",
  "1513": "a3a8",
  "1514": "f3a8",
  "1515": "a5c7",
  "1516": "d5d7",
  "1517": "h8h1",
  "1518": "g5e5",
  "1519": "g8d5",
  "1520": "g7h7",
  "1521": "a4f4",
  "1522": "d6d2",
  "1523": "e5b5",
  "1524": "b5b1",
  "1525": "f2b2",
  "1526": "h5e8",
  "1527": "h2e2",
  "1528": "c4h4",
  "1529": "g3c7",
  "1530": "d4g4",
  "1531": "e8a4",
  "1532": "d2d7",
  "1533": "c7f4",
  "1534": "g8e6",
  "1535": "b2b7",
  "1536": "b7d7",
  "1537": "c4a4",
  "1538": "a2e2",
  "1539": "c8c3",
  "1540": "e7h7",
  "1541": "h5b5",
  "1542": "b5e5",
  "1543": "h8d4",
  "1544": "b7b2",
  "1545": "b7b1",
  "1546": "d7h7",
  "1547": "f6h8",
  "1548": "f4h2",
  "1549": "f3b7",
  "1550": "e1b1",
  "1551": "f6a1",
  "1552": "a7c5",
  "1553": "a2c4",
  "1554": "c3c7",
  "1555": "d6d3",
  "1556": "a4c3",
  "1557": "f7f3",
  "1558": "f4c7",
  "1559": "h7h1",
  "1560": "e7a7",
  "1561": "g2a2",
  "1562": "a5d5",
  "1563": "e4b7",
  "1564": "h8h3",
  "1565": "h2h8",
  "1566": "g7g1",
  "1567": "g1b1",
  "1568": "h3c3",
  "1569": "a3a1",
  "1570": "h2h6",
  "1571": "a7c8",
  "1572": "b7h7",
  "1573": "d7g7",
  "1574": "a4a8",
  "1575": "b7b4",
  "1576": "b4b8",
  "1577": "g6b1",
  "1578": "a8h1",
  "1579": "h1h5",
  "1580": "f7h7",
  "1581": "g2b2",
  "1582": "f6d8",
  "1583": "f3b3",
  "1584": "h6f4",
  "1585": "c1g1",
  "1586": "g4d7",
  "1587": "h5d1",
  "1588": "h8f7",
  "1589": "f4f1",
  "1590": "h4d4",
  "1591": "c2h2",
  "1592": "b6f6",
  "1593": "h4e1",
  "1594": "c5g1",
  "1595": "a5a2",
  "1596": "a4d1",
  "1597": "d2f1",
  "1598": "d4g1",
  "1599": "d6d1",
  "1600": "e1c3",
  "1601": "g6f8",
  "1602": "a2f2",
  "1603": "f2f7",
  "1604": "c7g3",
  "1605": "e4g6",
  "1606": "d3b1",
  "1607": "g6e8",
  "1608": "a1h8",
  "1609": "g7g2",
  "1610": "d3h7",
  "1611": "c5h5",
  "1612": "h3d3",
  "1613": "h8g6",
  "1614": "e7g8",
  "1615": "a3e3",
  "1616": "a5f5",
  "1617": "a2e6",
  "1618": "e8h5",
  "1619": "a8b6",
  "1620": "g4g8",
  "1621": "f4d4",
  "1622": "a2g8",
  "1623": "g8a2",
  "1624": "f4c4",
  "1625": "d2d6",
  "1626": "a1f6",
  "1627": "b6g1",
  "1628": "b3h3",
  "1629": "h7e4",
  "1630": "b6d6",
  "1631": "e4a4",
  "1632": "h7c7",
  "1633": "h8b8",
  "1634": "h1b7",
  "1635": "c6f6",
  "1636": "e5b8",
  "1637": "h2h7",
  "1638": "h7a7",
  "1639": "h7b7",
  "1640": "g4c8",
  "1641": "c2h7",
  "1642": "c7e7",
  "1643": "b2b8",
  "1644": "g6c2",
  "1645": "h7c2",
  "1646": "g6e7",
  "1647": "h7d7",
  "1648": "d5a2",
  "1649": "c6h1",
  "1650": "h1c6",
  "1651": "f5a5",
  "1652": "h4a4",
  "1653": "a5e1",
  "1654": "e5a1",
  "1655": "f2b6",
  "1656": "a2h2",
  "1657": "b3a1",
  "1658": "d4h4",
  "1659": "g2c2",
  "1660": "a2g2",
  "1661": "f8b8",
  "1662": "e8b5",
  "1663": "a1g7",
  "1664": "c7b8",
  "1665": "f6f8",
  "1666": "b7f7",
  "1667": "b2g2",
  "1668": "g7c3",
  "1669": "c3g7",
  "1670": "a8c6",
  "1671": "a7h7",
  "1672": "g3g5",
  "1673": "g3c3",
  "1674": "d5h1",
  "1675": "h6h8",
  "1676": "g3f1",
  "1677": "h5h1",
  "1678": "g2g6",
  "1679": "h2e5",
  "1680": "e5a5",
  "1681": "a5h5",
  "1682": "g1g6",
  "1683": "b1f1",
  "1684": "h7f8",
  "1685": "g8a8",
  "1686": "f4b4",
  "1687": "h2f3",
  "1688": "b2a1",
  "1689": "g3b8",
  "1690": "f1h1",
  "1691": "h1h6",
  "1692": "h6c6",
  "1693": "c6g6",
  "1694": "f7a2",
  "1695": "g1d4",
  "1696": "d4b4",
  "1697": "a8f3",
  "1698": "b6g6",
  "1699": "g1g5",
  "1700": "a3h3",
  "1701": "h3h8",
  "1702": "g6d6",
  "1703": "f7b3",
  "1704": "g7g3",
  "1705": "g3g8",
  "1706": "f1d2",
  "1707": "e4b1",
  "1708": "g2h1q",
  "1709": "h2h5",
  "1710": "f7d7",
  "1711": "g2e1",
  "1712": "a8g2",
  "1713": "h5a5",
  "1714": "e3g2",
  "1715": "h3h7",
  "1716": "f7f1",
  "1717": "b5g5",
  "1718": "e6h6",
  "1719": "f1h2",
  "1720": "b3e3",
  "1721": "e2c1",
  "1722": "a7a2",
  "1723": "d1c3",
  "1724": "g8c8",
  "1725": "h8b2",
  "1726": "e5g7",
  "1727": "a6h6",
  "1728": "e7b7",
  "1729": "d6g6",
  "1730": "f7h6",
  "1731": "b8g3",
  "1732": "h7b1",
  "1733": "b1g6",
  "1734": "e2f1q",
  "1735": "c1h1",
  "1736": "a2a6",
  "1737": "h8e5",
  "1738": "g6b6",
  "1739": "g6g1",
  "1740": "c7h7",
  "1741": "e2g1",
  "1742": "b3d3",
  "1743": "d5g8",
  "1744": "h1b1",
  "1745": "e8c7",
  "1746": "h6d6",
  "1747": "g7c7",
  "1748": "g6g3",
  "1749": "c8e7",
  "1750": "a6g6",
  "1751": "a7a3",
  "1752": "c3c1",
  "1753": "f7a7",
  "1754": "g7a1",
  "1755": "e1c2",
  "1756": "g1c5",
  "1757": "c1f1",
  "1758": "h1h8",
  "1759": "b8f4",
  "1760": "b4f4",
  "1761": "e3g1",
  "1762": "c1a2",
  "1763": "f5b5",
  "1764": "h5d5",
  "1765": "c3h8",
  "1766": "h7h4",
  "1767": "f6b6",
  "1768": "c3g3",
  "1769": "g5a5",
  "1770": "h7h3",
  "1771": "a4h4",
  "1772": "g3d3",
  "1773": "g7a7",
  "1774": "h4c4",
  "1775": "a5g5",
  "1776": "f3f1",
  "1777": "b1h1",
  "1778": "b3f3",
  "1779": "g5c5",
  "1780": "g3a3",
  "1781": "g5g8",
  "1782": "g8b3",
  "1783": "g7b2",
  "1784": "h2c7",
  "1785": "f1e3",
  "1786": "h2g1q",
  "1787": "e7f8q",
  "1788": "g6a6",
  "1789": "g2f1q",
  "1790": "b2h2",
  "1791": "f8d7",
  "1792": "b7c8q",
  "1793": "f7g8q",
  "1794": "f7e8q",
  "1795": "f4f7",
  "1796": "a6a3",
  "1797": "d3a3",
  "1798": "e1a5",
  "1799": "c7b8q",
  "1800": "c3h3",
  "1801": "g2b7",
  "1802": "a6b8",
  "1803": "h6a6",
  "1804": "f8h7",
  "1805": "d7c8q",
  "1806": "c7h2",
  "1807": "f2e1q",
  "1808": "g8c4",
  "1809": "e2d1q",
  "1810": "g2g8",
  "1811": "g1b6",
  "1812": "b3g3",
  "1813": "d2e1q",
  "1814": "a7a1",
  "1815": "h8a1"
}